# ItemCustomId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..ItemCustomId Property
FabricationPart Class See Also
---
The item custom identifier for the fabrication part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public int ItemCustomId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ItemCustomId As Integer
	Get
```

Visual C++
---
```text
public:
property int ItemCustomId {
	int get ();
}
```

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace